CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/src/em_emu.c
  /* Wait until previous scaling is done. */
  EMU_VScaleWait();

  uint32_t em23vs = (EMU->CTRL & _EMU_CTRL_EM23VSCALE_MASK) >> _EMU_CTRL_EM23VSCALE_SHIFT;
  uint32_t em01vs = (EMU->STATUS & _EMU_STATUS_VSCALE_MASK) >> _EMU_STATUS_VSCALE_SHIFT;

  /* Inverse coding. */
  if (em23vs > em01vs) {
    EMU->CTRL |= EMU_CTRL_EM23VSCALEAUTOWSEN;
#if defined(_MSC_RAMCTRL_RAMWSEN_MASK)
    /* Set RAM wait states for safe EM2 wakeup. */
    BUS_RegMaskedSet(&MSC->RAMCTRL, (MSC_RAMCTRL_RAMWSEN
                                     | MSC_RAMCTRL_RAM1WSEN
                                     | MSC_RAMCTRL_RAM2WSEN));
#endif
  } else {
    EMU->CTRL &= ~EMU_CTRL_EM23VSCALEAUTOWSEN;
  }
}

/* Handle automatic HFRCO adjustment that may have occurred during EM2/EM3. */
static void vScaleAfterWakeup(void)
{
  if ((EMU->CTRL & EMU_CTRL_EM23VSCALEAUTOWSEN) != 0U) {
    /* The hardware may have updated the HFRCOCTRL register during EM2/EM3
     * entry if voltage scaling in EM2/EM3 is enabled. The hardware would
     * then update the HFRCO frequency to 19 MHz automatically. */
    uint32_t freqRange = (CMU->HFRCOCTRL & _CMU_HFRCOCTRL_FREQRANGE_MASK)
                         >> _CMU_HFRCOCTRL_FREQRANGE_SHIFT;
    if (freqRange == 0x08U) {
      SystemHfrcoFreq = 19000000;
    }
  }
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2) || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7)
typedef enum {
  dpllState_Save,         /* Save DPLL state. */
  dpllState_Restore,      /* Restore DPLL.    */
} dpllState_TypeDef;

/***************************************************************************//**
 * @brief
 *   Save or restore DPLL state.
 *
 * @param[in] action
 *    Value to indicate saving DPLL state or restoring its state.
 *
 * @note
 *   The function is used in EMU_Save() and EMU_Restore() to handle the
 *   DPLL state before entering EM2 or EM3 and after exiting EM2 or EM3.
 *   The function is required for the EFR32xG22 and EFR32xG27 families.
 *   On those families devices, the DPLL is disabled automatically when
 *   entering EM2, EM3. But exiting EM2, EM3 won't re-enable automatically
 *   the DPLL. Hence, the software needs to re-enable the DPLL upon EM2/3
 *   exit.
 ******************************************************************************/
static void dpllState(dpllState_TypeDef action)
{
  CMU_ClkDiv_TypeDef div;
  static uint32_t dpllRefClk = CMU_DPLLREFCLKCTRL_CLKSEL_DISABLED;

  if (action == dpllState_Save) {
    dpllRefClk = CMU_DPLLREFCLKCTRL_CLKSEL_DISABLED;
    CMU->CLKEN0_SET = CMU_CLKEN0_DPLL0;
    if (DPLL0->EN == DPLL_EN_EN) {
      /* DPLL is in use, save reference clock selection. */
      dpllRefClk = CMU->DPLLREFCLKCTRL;
    }
  } else { /* Restore */
    if ((dpllRefClk != CMU_DPLLREFCLKCTRL_CLKSEL_DISABLED)
        && (DPLL0->EN != DPLL_EN_EN)) {
      /* Restore DPLL reference clock selection. */
      CMU->DPLLREFCLKCTRL = dpllRefClk;
      /* Only wait for DPLL lock if HFRCODPLL is used as SYSCLK. */
      if (CMU_ClockSelectGet(cmuClock_SYSCLK) == cmuSelect_HFRCODPLL) {
        /* Set HCLK prescaler to safe value to avoid overclocking while locking. */
        div = CMU_ClockDivGet(cmuClock_HCLK);
        if (div == 1U) {
          CMU_ClockDivSet(cmuClock_HCLK, 2U);
        }

        /* Relock DPLL and wait for ready. */
        DPLL0->IF_CLR = DPLL_IF_LOCK | DPLL_IF_LOCKFAILLOW | DPLL_IF_LOCKFAILHIGH;
        DPLL0->EN_SET = DPLL_EN_EN;
        while ((DPLL0->IF & DPLL_IF_LOCK) == 0U) {
        }

        /* Restore HCLK prescaler. */
        if (div == 1U) {
          CMU_ClockDivSet(cmuClock_HCLK, 1U);
        }
      } else {
        /* Relock DPLL and exit without waiting for ready. */
        DPLL0->EN_SET = DPLL_EN_EN;
      }
    }
  }
}
#endif

/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @addtogroup emu EMU - Energy Management Unit
 * @brief Energy Management Unit (EMU) Peripheral API
 * @details
 *  This module contains functions to control the EMU peripheral of Silicon
 *  Labs 32-bit MCUs and SoCs. The EMU handles the different low energy modes
 *  in Silicon Labs microcontrollers.
 * @{
 ******************************************************************************/

#if defined(EMU_VSCALE_EM01_PRESENT)
/***************************************************************************//**
 * @brief
 *   Update the EMU module with Energy Mode 0 and 1 configuration.
 *
 * @param[in] em01Init
 *    Energy Mode 0 and 1 configuration structure.
 ******************************************************************************/
void EMU_EM01Init(const EMU_EM01Init_TypeDef *em01Init)
{
  vScaleEM01Config.vScaleEM01LowPowerVoltageEnable =
    em01Init->vScaleEM01LowPowerVoltageEnable;
  EMU_VScaleEM01ByClock(0, true);
}
#endif

/***************************************************************************//**
 * @brief
 *   Update the EMU module with Energy Mode 2 and 3 configuration.
 *
 * @param[in] em23Init
 *    Energy Mode 2 and 3 configuration structure.
 ******************************************************************************/
void EMU_EM23Init(const EMU_EM23Init_TypeDef *em23Init)
{
#if defined(_EMU_CTRL_EMVREG_MASK)
  EMU->CTRL = em23Init->em23VregFullEn ? (EMU->CTRL | EMU_CTRL_EMVREG)
              : (EMU->CTRL & ~EMU_CTRL_EMVREG);
#elif defined(_EMU_CTRL_EM23VREG_MASK)
  EMU->CTRL = em23Init->em23VregFullEn ? (EMU->CTRL | EMU_CTRL_EM23VREG)
              : (EMU->CTRL & ~EMU_CTRL_EM23VREG);
#else
  (void)em23Init;
#endif

#if defined(EMU_VSCALE_PRESENT)
  EMU->CTRL = (EMU->CTRL & ~_EMU_CTRL_EM23VSCALE_MASK)
              | ((uint32_t)em23Init->vScaleEM23Voltage << _EMU_CTRL_EM23VSCALE_SHIFT);
#if defined(CMU_HFXOCTRL_AUTOSTARTSELEM0EM1)
  if (em23Init->vScaleEM23Voltage == emuVScaleEM23_LowPower) {
    /* Voltage scaling is not compatible with HFXO auto start and select. */
    EFM_ASSERT((CMU->HFXOCTRL & CMU_HFXOCTRL_AUTOSTARTSELEM0EM1) == 0U);
  }
#endif
#endif
}

/***************************************************************************//**
 * @brief
 *   Energy mode 2/3 pre-sleep hook function.
 *
 * @details
 *   This function is called by EMU_EnterEM2() and EMU_EnterEM3() functions
 *   just prior to execution of the WFI instruction. The function implementation
 *   does not perform anything, but it is SL_WEAK so that it can be re-
 *   implemented in application code if actions are needed.
 ******************************************************************************/
SL_WEAK void EMU_EM23PresleepHook(void)
{
}

/***************************************************************************//**
 * @brief
 *   EFP's Energy mode 2/3 pre-sleep hook function.
 *
 * @details
 *   This function is similar to @ref EMU_EM23PresleepHook() but is reserved
 *   for EFP usage.
 *
 * @note
 *   The function is primarily meant to be used in systems with EFP circuitry.
 *   (EFP = Energy Friendly Pmic (PMIC = Power Management IC)).
 *   In such systems there is a need to drive certain signals to EFP pins to
 *   notify about energy mode transitions.
 ******************************************************************************/
SL_WEAK void EMU_EFPEM23PresleepHook(void)
{
}

/***************************************************************************//**
 * @brief
 *   Energy mode 2/3 post-sleep hook function.
 *
 * @details
 *   This function is called by EMU_EnterEM2() and EMU_EnterEM3() functions
 *   just after wakeup from the WFI instruction. The function implementation
 *   does not perform anything, but it is SL_WEAK so that it can be re-
 *   implemented in application code if actions are needed.
 ******************************************************************************/
SL_WEAK void EMU_EM23PostsleepHook(void)
{
}

/***************************************************************************//**
 * @brief
 *   EFP's Energy mode 2/3 post-sleep hook function.
 *
 * @details
 *   This function is similar to @ref EMU_EM23PostsleepHook() but is reserved
 *   for EFP usage.
 *
 * @note
 *   The function is primarily meant to be used in systems with EFP circuitry.
 *   (EFP = Energy Friendly Pmic (PMIC = Power Management IC)).
 *   In such systems there is a need to drive certain signals to EFP pins to
 *   notify about energy mode transitions.
 ******************************************************************************/
SL_WEAK void EMU_EFPEM23PostsleepHook(void)
{
}

/***************************************************************************//**
 * @brief
 *   Enter energy mode 2 (EM2).
 *
 * @details
 *   When entering EM2, high-frequency clocks are disabled, i.e., HFXO, HFRCO
 *   and AUXHFRCO (for AUXHFRCO, see exception note below). When re-entering
 *   EM0, HFRCO is re-enabled and the core will be clocked by the configured
 *   HFRCO band. This ensures a quick wakeup from EM2.
 *
 *   However, prior to entering EM2, the core may have been using another
 *   oscillator than HFRCO. The @p restore parameter gives the user the option
 *   to restore all HF oscillators according to state prior to entering EM2,
 *   as well as the clock used to clock the core. This restore procedure is
 *   handled by SW. However, since handled by SW, it will not be restored
 *   before completing the interrupt function(s) waking up the core!
 *
 * @note
 *   If restoring core clock to use the HFXO oscillator, which has been
 *   disabled during EM2 mode, this function will stall until the oscillator
 *   has stabilized. Stalling time can be reduced by adding interrupt
 *   support detecting stable oscillator, and an asynchronous switch to the
 *   original oscillator. See CMU documentation. Such a feature is however
 *   outside the scope of the implementation in this function.
 * @note
 *   If ERRATA_FIX_EMU_E110_ENABLE is active, the core's SLEEPONEXIT feature
 *   can not be used.
 * @note
 *   This function is incompatible with the Power Manager module. When the
 *   Power Manager module is present, it must be the one deciding at which
 *   EM level the device sleeps to ensure the application properly works. Using
 *   both at the same time could lead to undefined behavior in the application.
 * @par
 *   If HFXO is re-enabled by this function, and NOT used to clock the core,
 *   this function will not wait for HFXO to stabilize. This must be considered
 *   by the application if trying to use features relying on that oscillator
 *   upon return.
 * @par
 *   If a debugger is attached, the AUXHFRCO will not be disabled if enabled
 *   upon entering EM2. It will thus remain enabled when returning to EM0
 *   regardless of the @p restore parameter.
 * @par
 *   If HFXO autostart and select is enabled by using CMU_HFXOAutostartEnable(),
 *   the automatic starting and selecting of the core clocks will be done,
 *   regardless of the @p restore parameter, when waking up on the wakeup
 *   sources corresponding to the autostart and select setting.
 * @par
 *   If voltage scaling is supported, the restore parameter is true and the EM0
 *   voltage scaling level is set higher than the EM2 level, then the EM0 level is
 *   also restored.
 * @par
 *   On Series 2 Config 2 devices (EFRxG22), this function will also relock the
 *   DPLL if the DPLL is used and @p restore is true.
 *
 *   Note that the hardware will automatically update the HFRCO frequency in the
 *   case where voltage scaling is used in EM2/EM3 and not in EM0/EM1. When the
 *   restore argument to this function is true then software will restore the
 *   original HFRCO frequency after EM2/EM3 wake up. If the restore argument is
 *   false then the HFRCO frequency is 19 MHz when coming out of EM2/EM3 and
 *   all wait states are at a safe value.
 *
 * @param[in] restore
 *   @li true - save and restore oscillators, clocks and voltage scaling, see
 *   function details.
 *   @li false - do not save and restore oscillators and clocks, see function
 *   details.
 * @par
 *   The @p restore option should only be used if all clock control is done
 *   via the CMU API.
 ******************************************************************************/
void EMU_EnterEM2(bool restore)
{
#if defined(SLI_METRIC_EM2_HOOK)
  sli_metric_em23_wake_init(SLI_INIT_EM2_WAKE);
#endif

#if defined(ERRATA_FIX_EMU_E107_ENABLE)
  bool errataFixEmuE107En;
  uint32_t nonWicIntEn[2];
#endif

#if defined(ERRATA_FIX_EMU_E110_ENABLE)
  bool errataFixEmuE110En;
#endif

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_2) || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7)
  if (restore) {
    dpllState(dpllState_Save);
  }
#endif

#if (_SILICON_LABS_32B_SERIES < 2)
  /* Only save EMU and CMU state if restored on wake-up. */
  if (restore) {
    emState(emState_Save);
  }
#endif

#if defined(_EMU_CTRL_EM23VSCALE_MASK) && defined(EMU_CTRL_EM23VSCALEAUTOWSEN)
  vScaleDownEM23Setup();
#endif

