CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/src/em_emu.c
  BUS_RegMaskedWrite(&DCDC->BSTEM01CTRL,
                     _DCDC_BSTEM01CTRL_IPKVAL_MASK,
                     ((uint32_t)boostPeakCurrentEM01 << _DCDC_BSTEM01CTRL_IPKVAL_SHIFT));

  if (dcdcLocked) {
    EMU_DCDCLock();
  }

  if (!dcdcClkWasEnabled) {
    CMU->CLKEN0_CLR = CMU_CLKEN0_DCDC;
  }

  EMU_DCDCUpdatedHook();
}

/***************************************************************************//**
 * @brief
 *   Enable/disable Boost External Shutdown Mode.
 *
 * @param[in] enable
 *   The boost DC-DC converter can be activated or deactivated
 *   from a dedicated BOOST_EN pin on the device if enable is true.
 ******************************************************************************/
void EMU_BoostExternalShutdownEnable(bool enable)
{
  if (enable) {
    EMU->BOOSTCTRL_CLR = EMU_BOOSTCTRL_BOOSTENCTRL;
  } else {
    EMU->BOOSTCTRL_SET = EMU_BOOSTCTRL_BOOSTENCTRL;
  }
}
#endif /* EMU_SERIES2_DCDC_BOOST_PRESENT */

#if defined(EMU_SERIES2_DCDC_BUCK_PRESENT) \
  || defined(EMU_SERIES2_DCDC_BOOST_PRESENT)
/***************************************************************************//**
 * @brief
 *   Indicate that the DCDC peripheral bus clock enable has changed allowing
 *   RAIL to react accordingly.
 *
 * @details
 *   This function is called after DCDC has been enabled or disabled.
 *   The function implementation does not perform anything, but it is SL_WEAK
 *   so that it can use the RAIL version if needed.
 ******************************************************************************/
SL_WEAK void EMU_DCDCUpdatedHook(void)
{
}

/***************************************************************************//**
 * @brief
 *   Set DCDC regulator operating mode.
 *
 * @param[in] dcdcMode
 *   DCDC mode.
 * @return
 *   Returns the status of the DCDC mode set operation.
 * @verbatim
 *   SL_STATUS_OK - Operation completed successfully.
 *   SL_STATUS_TIMEOUT - Operation EMU DCDC set mode timeout.
 * @endverbatim
 ******************************************************************************/
sl_status_t EMU_DCDCModeSet(EMU_DcdcMode_TypeDef dcdcMode)
{
  bool dcdcLocked;
  uint32_t currentDcdcMode;
  sl_status_t error = SL_STATUS_OK;
  uint32_t timeout = 0;
  CMU->CLKEN0_SET = CMU_CLKEN0_DCDC;
#if defined(_DCDC_EN_EN_MASK)
  DCDC->EN_SET = DCDC_EN_EN;
#endif
  dcdcLocked = ((DCDC->LOCKSTATUS & DCDC_LOCKSTATUS_LOCK) != 0);
  EMU_DCDCUnlock();

  if (dcdcMode == emuDcdcMode_Bypass) {
#if defined(_DCDC_SYNCBUSY_MASK)
#if defined(_DCDC_SYNCBUSY_CTRL_MASK)
    EMU_DCDCSync(DCDC_SYNCBUSY_CTRL);
#else
    EMU_DCDCSync(_DCDC_SYNCBUSY_MASK);
#endif
#endif
    currentDcdcMode = (DCDC->CTRL & _DCDC_CTRL_MODE_MASK) >> _DCDC_CTRL_MODE_SHIFT;

    if (currentDcdcMode != emuDcdcMode_Bypass) {
      /* Switch to BYPASS mode if it is not the current mode */
      DCDC->CTRL_CLR = DCDC_CTRL_MODE;
      while (((DCDC->STATUS & DCDC_STATUS_BYPSW) == 0U) && (timeout < EMU_DCDC_MODE_SET_TIMEOUT)) {
        /* Wait for BYPASS switch enable. */
        timeout++;
      }
      if (timeout >= EMU_DCDC_MODE_SET_TIMEOUT) {
        error = SL_STATUS_TIMEOUT;
      }
    }
#if defined(_DCDC_EN_EN_MASK)
    DCDC->EN_CLR = DCDC_EN_EN;
#endif
  } else {
    while (((DCDC->STATUS & DCDC_STATUS_VREGIN) != 0U) && (timeout < EMU_DCDC_MODE_SET_TIMEOUT)) {
      /* Wait for VREGIN voltage to rise above threshold. */
      timeout++;
    }
    if (timeout >= EMU_DCDC_MODE_SET_TIMEOUT) {
      error = SL_STATUS_TIMEOUT;
    } else {
      DCDC->IF_CLR = DCDC_IF_REGULATION;
      DCDC->CTRL_SET = DCDC_CTRL_MODE;
      timeout = 0;
      while (((DCDC->IF & DCDC_IF_REGULATION) == 0U) && (timeout < EMU_DCDC_MODE_SET_TIMEOUT)) {
        /* Wait for DCDC to complete it's startup. */
        timeout++;
      }
      if (timeout >= EMU_DCDC_MODE_SET_TIMEOUT) {
        error = SL_STATUS_TIMEOUT;
      }
    }
  }

  if (dcdcLocked) {
    EMU_DCDCLock();
  }

  EMU_DCDCUpdatedHook();
  return error;
}
#endif /* EMU_SERIES2_DCDC_BUCK_PRESENT || EMU_SERIES2_DCDC_BOOST_PRESENT */

#if defined(EMU_SERIES2_DCDC_BUCK_PRESENT)
/***************************************************************************//**
 * @brief
 *   Configure the DCDC regulator.
 *
 * @param[in] dcdcInit
 *  The DCDC initialization structure.
 *
 * @return
 *   True if initialization parameters are valid.
 ******************************************************************************/
bool EMU_DCDCInit(const EMU_DCDCInit_TypeDef *dcdcInit)
{
  bool dcdcLocked;

  CMU->CLKEN0_SET = CMU_CLKEN0_DCDC;
#if defined(_DCDC_EN_EN_MASK)
  DCDC->EN_SET    = DCDC_EN_EN;
#endif
  dcdcLocked = ((DCDC->LOCKSTATUS & DCDC_LOCKSTATUS_LOCK) != 0);
  EMU_DCDCUnlock();

  EMU->VREGVDDCMPCTRL = ((uint32_t)dcdcInit->cmpThreshold
                         << _EMU_VREGVDDCMPCTRL_THRESSEL_SHIFT)
                        | EMU_VREGVDDCMPCTRL_VREGINCMPEN;

#if defined(_DCDC_SYNCBUSY_MASK)
#if defined(_DCDC_SYNCBUSY_CTRL_MASK)
  EMU_DCDCSync(DCDC_SYNCBUSY_CTRL | DCDC_SYNCBUSY_EM01CTRL0 | DCDC_SYNCBUSY_EM23CTRL0);
#else
  EMU_DCDCSync(_DCDC_SYNCBUSY_MASK);
#endif
#endif
#if defined(_DCDC_CTRL_DCMONLYEN_MASK)
  DCDC->CTRL = (DCDC->CTRL & ~(_DCDC_CTRL_IPKTMAXCTRL_MASK
                               | _DCDC_CTRL_DCMONLYEN_MASK))
               | ((uint32_t)dcdcInit->tonMax << _DCDC_CTRL_IPKTMAXCTRL_SHIFT)
               | ((uint32_t)(dcdcInit->dcmOnlyEn ? 1U : 0U) << _DCDC_CTRL_DCMONLYEN_SHIFT);
#else
  DCDC->CTRL = (DCDC->CTRL & ~(_DCDC_CTRL_IPKTMAXCTRL_MASK))
               | ((uint32_t)dcdcInit->tonMax << _DCDC_CTRL_IPKTMAXCTRL_SHIFT);
#endif
  DCDC->EM01CTRL0 = ((uint32_t)dcdcInit->driveSpeedEM01 << _DCDC_EM01CTRL0_DRVSPEED_SHIFT)
                    | ((uint32_t)dcdcInit->peakCurrentEM01 << _DCDC_EM01CTRL0_IPKVAL_SHIFT);
  DCDC->EM23CTRL0 = ((uint32_t)dcdcInit->driveSpeedEM23 << _DCDC_EM23CTRL0_DRVSPEED_SHIFT)
                    | ((uint32_t)dcdcInit->peakCurrentEM23 << _DCDC_EM23CTRL0_IPKVAL_SHIFT);

  EMU_DCDCModeSet(dcdcInit->mode);

  if (dcdcLocked) {
    EMU_DCDCLock();
  }

  EMU_DCDCUpdatedHook();

