CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/src/em_emu.c
  // Read temperature twice to ensure a stable value
  do {
    val1 = (EMU->TEMP & _EMU_TEMP_TEMP_MASK)
           >> _EMU_TEMP_TEMP_SHIFT;
    val2 = (EMU->TEMP & _EMU_TEMP_TEMP_MASK)
           >> _EMU_TEMP_TEMP_SHIFT;
  } while (val1 != val2);

  return diTemp + tempCo * ((int) diEmu - (int) val1);
#endif
}
#endif // defined(_EMU_TEMP_TEMP_MASK)

#if defined(EMU_CTRL_EFPDIRECTMODEEN)
/***************************************************************************//**
 * @brief
 *   Enable/disable EFP Direct Mode.
 *
 * @param[in] enable
 *   True to enable direct mode.
 ******************************************************************************/
void EMU_EFPDirectModeEnable(bool enable)
{
  if (enable) {
    EMU->CTRL_SET = EMU_CTRL_EFPDIRECTMODEEN;
  } else {
    EMU->CTRL_CLR = EMU_CTRL_EFPDIRECTMODEEN;
  }
}
#endif

#if defined(EMU_CTRL_EFPDRVDECOUPLE)
/***************************************************************************//**
 * @brief
 *   Set to enable EFP to drive Decouple voltage.
 *
 * @details
 *   Once set, internal LDO will be disabled, and the EMU will control EFP for
 *   voltage-scaling. Note that because this bit disables the internal LDO
 *   powering the core, it should not be set until after EFP's DECOUPLE output has
 *   been configured and enabled.
 *
 * @param[in] enable
 *   True to enable EFP to drive Decouple voltage.
 ******************************************************************************/
void EMU_EFPDriveDecoupleSet(bool enable)
{
  if (enable) {
    EMU->CTRL_SET = EMU_CTRL_EFPDRVDECOUPLE;
  } else {
    EMU->CTRL_CLR = EMU_CTRL_EFPDRVDECOUPLE;
  }
}
#endif

#if defined(EMU_CTRL_EFPDRVDVDD)
/***************************************************************************//**
 * @brief
 *   Set to enable EFP to drive DVDD voltage.
 *
 * @details
 *   Set this if EFP's DCDC output is powering DVDD supply. This mode assumes that
 *   internal DCDC is not being used.
 *
 * @param[in] enable
 *   True to enable EFP to drive DVDD voltage.
 ******************************************************************************/
void EMU_EFPDriveDvddSet(bool enable)
{
  if (enable) {
    EMU->CTRL_SET = EMU_CTRL_EFPDRVDVDD;
  } else {
    EMU->CTRL_CLR = EMU_CTRL_EFPDRVDVDD;
  }
}
#endif

/** @} (end addtogroup emu) */
#endif /* __EM_EMU_H */
